libadmintools/smartschool/V3Binding.saveClass.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="https://sanctamaria-aarschot.smartschool.be/Webservices/V3">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:saveClass>
   <accesscode></accesscode>
   <name></name>
   <desc></desc>
   <code></code>
   <parent></parent>
   <untis></untis>
   <instituteNumber></instituteNumber>
   <adminNumber></adminNumber>
  </ns1:saveClass>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
